const navLinks = [
  {
    name: "Work",
    link: "#work",
  },
  {
    name: "Experience",
    link: "#experience",
  },
  {
    name: "Skills",
    link: "#skills",
  },
];

const words = [
  { text: "Ideas", imgPath: "/images/ideas.svg" },
  { text: "Concepts", imgPath: "/images/concepts.svg" },
  { text: "Designs", imgPath: "/images/designs.svg" },
  { text: "Code", imgPath: "/images/code.svg" },
  { text: "Ideas", imgPath: "/images/ideas.svg" },
  { text: "Concepts", imgPath: "/images/concepts.svg" },
  { text: "Designs", imgPath: "/images/designs.svg" },
  { text: "Code", imgPath: "/images/code.svg" },
];

const counterItems = [
  { value: 18, suffix: "", label: "Years of Age" },
  { value: 0, suffix: "5/02/2550", label: "Date of Birth" },
  { value: 5, suffix: "", label: "Project" },
  { value: 3, suffix: ".79", label: "Grade Point Average Cumulative(GPAX 5 Semester)" },
];

const logoIconsList = [
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
  {
    imgPath: "/images/logos/mvsk.png",
  },
];

const abilities = [
  {
    imgPath: "/images/seo.png",
    title: "Quality Focus",
    desc: "Delivering high-quality results while maintaining attention to every detail.",
  },
  {
    imgPath: "/images/chat.png",
    title: "Reliable Communication",
    desc: "Keeping you updated at every step to ensure transparency and clarity.",
  },
  {
    imgPath: "/images/time.png",
    title: "On-Time Delivery",
    desc: "Making sure projects are completed on schedule, with quality & attention to detail.",
  },
];

const techStackImgs = [
  {
    name: "React Developer",
    imgPath: "/images/logos/react.png",
  },
  {
    name: "Python Developer",
    imgPath: "/images/logos/python.svg",
  },
  {
    name: "Backend Developer",
    imgPath: "/images/logos/node.png",
  },
  {
    name: "Game Developer",
    imgPath: "/images/logos/three.png",
  },
  {
    name: "Project Manager",
    imgPath: "/images/logos/git.svg",
  },
];

const techStackIcons = [
  {
    name: "React Developer",
    modelPath: "/models/react_logo-transformed.glb",
    scale: 1,
    rotation: [0, 0, 0],
  },
  {
    name: "Python Developer",
    modelPath: "/models/python-transformed.glb",
    scale: 0.8,
    rotation: [0, 0, 0],
  },
  {
    name: "Backend Developer",
    modelPath: "/models/node-transformed.glb",
    scale: 5,
    rotation: [0, -Math.PI / 2, 0],
  },
  {
    name: "Game Developer",
    modelPath: "/models/game-logo.glb",
    scale: 0.05,
    rotation: [0, 0, 0],
  },
  {
    name: "Figma",
    modelPath: "/models/figma-logo.glb",
    scale: 0.05,
    rotation: [0, -Math.PI / 4, 0],
  },
];


const expCards = [
  {
    review: "ยินดีต้อนรับผู้กล้าทุกท่าน กลับมาอีกครั้งกับ CSCAMP 16 ค่ายวิทยาการคอมพิวเตอร์ พระจอมเกล้าลาดกระบัง!! ค่าย CSCAMP 16 ของเรานั้นต้องการเปิดโอกาสให้น้องๆผู้กล้า ระดับชั้นมัธยมศึกษาปีที่ 4 และ 5 ปีการศึกษา 2566 ได้เรียนรู้เกี่ยวกับวิทยาการคอมพิวเตอร์ และรู้จักกับภาควิชาวิทยาการคอมพิวเตอร์ คณะวิทยาศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง โดยเหล่าผู้กล้ารุ่นพี่ วิทยาการคอมพิวเตอร์ลาดกระบัง!!",
    imgPath: "/images/exp1.jpeg",
    logoPath: "/images/exp_logo1.jpg",
    title: "CS Camp 16",
    date: "Online วันที่ 23 - 24 เมษายน 2567 ",
    date2: "🗓️ Onsite วันที่ 26 - 28 เมษายน 2567",
    responsibilities: [
      "ได้รับความรู้มากมายในด้าน Basic Algoriyhm Basic Java และ Basic concept of OOP. ",
      "ได้ปฏิบัติมนงานจริงอย่างการทำ project ด้วยภาษา Java",
      "ได้รับความรู้เกี่ยวคณะวิทยาการคอมพิวเตอร์ว่าแตกต่างจากวิศวกรรมคอมพิวเตอร์อย่างไร ทำให้สามารถตัดสินใจในการเลือกเรียนต่อไปได้",
    ],
  },
  {
    review: "ด้วยภาควิชาวิทยาการคอมพิวเตอร์ คณะวิทยาศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง ได้กำหนดจัดโครงการนักพัฒนามืออาชีพ 2567 ครั้งที่ 2 ระหว่างวันที่ 7 - 9 สิงหาคม พ.ศ. 2567 ใน รูปแบบออนไลน์เป็นเวลา 3 วัน และวันที่ 10 สิงหาคม พ.ศ. 2567 ในรูปแบบออนไซต์ ณ คณะวิทยาศาสตร์ สจล.และจะมีการสอบวัดทักษะการเขียนโปรแกรมก่อนสิ้นสุดโครงการ เพื่อคัดเลือกนักเรียนเข้าสู่ระบบ Thai University Central Admission System (TCAS) ในรอบที่ 1 โครงการนักพัฒนามืออาชีพ สาขาวิชาวิทยาการคอมพิวเตอร์ คณะ วิทยาศาสตร์ สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง ซึ่งในโครงการนักพัฒนามืออาชีพ 2566 ไม่มีการสอบวัดทักษะการเขียนโปรแกรม จึงจำเป็นต้องเข้าร่วมการสอบในโครงการนักพัฒนามืออาชีพ 2567",
    imgPath: "/images/exp2.jpg",
    logoPath: "/images/exp_logo2.png",
    title: "โครงการนักพัฒนามืออาชีพ 2567",
    date: "Online วันที่ 24 - 26 กรกฎาคม 2567 และ วันที่ 7 - 9 สิงหาคม 2567 ",
    date2: "🗓️Onsite วันที่ 27 กรกฎาคม และ วันที่ 10 สิงหาคม 2567",
    responsibilities: [
      "ได้ทำการสอบวัดระดับทักษะการเขียนโปรแกรมในรูปแบบความยากที่แตกต่างกันไป สามารถช่วยพัฒนาทักษะการเขียนโปรแกรมและทักษะการคิดอย่างมีระบบอีกด้วย",
      "ได้รับโอกาสในการเข้าศึกษาต่อในคณะวิทยาศาสตร์ สาขาวิทยาการคอมพิวเตอร์",
      "ทำให้รู้ว่าระดับการเขียนโปรแกรมของตัวเองยังไม่เก่งพอ และสามารถรู้ได้ว่าจุดอ่อนจุดแข็งคืออะไร สามารถมาพัฒนาต่อในอนาคตได้",
    ],
  },
  {
    review: "ขอเชิญนักเรียน นิสิต และนักศึกษาที่มีความสามารถในการพัฒนาซอฟต์แวร์ส่งผลงานเข้าร่วมการแข่งขันพัฒนาโปรแกรมคอมพิวเตอร์แห่งประเทศไทย ชิงถ้วยพระราชทานสมเด็จพระกนิษฐาริราชเจ้า กรมสมเด็จพระเทพรัตนราชสุดา ฯ สยามบรมราชกุมารี พร้อมรางวัลและเกียรติบัตร",
    imgPath: "/images/exp3-1.jpg",
    logoPath: "/images/nsc-logo.png",
    title: "การแข่งขันพัฒนาโปรแกรมคอมพิวเตอร์แห่งประเทศไทย ครั้งที่ 27 (NSC 2025)",
    date: "พัฒนาโปรแกรม วันที่ 14 กุมภาพันธ์ - 18 กรกฎาคม 2568",
    date2: "🗓️ นำเสนอ วันที่ 31 กรกฎาคม 2568",
    responsibilities: [
      "ได้รู้จักการวางแผน คุยงาน นัดคุยงาน ประชุมกัน และระดมความคิดกันในการพัฒนาโปรแกรมคอมพิวเตอร์",
      "การได้รู้จักการวางแผนในการทำงานและจัดแบ่งเวลาให้เหมาะสม",
      "ได้รับ feedback จากกรรมการว่าต้องแก้ตรงไหนบ้าง ต้องทำอย่างไรต่อไปในอนาคต",
    ],
  },
    {
    review: "เงินทุนพัฒนาผลงาน รอบข้อเสนอโครงการและรอบนำเสนอผลงาน",
    imgPath: "/images/exp3-2.jpg",
    logoPath: "/images/nsc-logo.png",
    title: "รับทุนรอบนำเสนอ 2000 บาท",
    date: "วันที่ 31 กรกฎาคม 2568",
    responsibilities: [
      "ได้รับทุนจำนวน 2000 บาทในการพัฒนาโปรแกรมต่อไปในอนาคต",
    ],
  },
    {
    review: "PSU Open House 2024 (งาน ม.อ. วิชาการ ประจำปี 2568) ✨ เปิดบ้าน มหาวิทยาลัยสงขลานครินทร์พร้อมแล้ว....ให้ทุกคนได้สัมผัสประสบการณ์จริง! ในคณะที่ใช่ สาขาที่ชอบเตรียมตัวให้พร้อมแล้วมาค้นหาเส้นทางสู่ฝันไปด้วยกัน!",
    imgPath: "/images/exp-4.jpg",
    logoPath: "/images/psu-logo.png",
    title: "การแข่งขันออกแบบเว็บไซต์",
    date: "วันที่ 4 กันยายน 2567",
    responsibilities: [
      "ได้เรียนรู้การออกแบบ UX UI ให้เหมาะสมกับงานและสิ่งที่ต้องการจะสื่อออกไป",
      "ได้เรียนรู้ในการที่จะฟังความเห็นของเพื่อนร่วมทีมและสามารถนำความคิดเห็นมารวมกันในแบบที่ทั้งสองฝั่ง โอเคกัน",
      "ได้ฝึกฝนทักษะการเขียนโปรแกรมเว็บไซต์เพิ่มขึ้น",
    ],
  },
    {
    review: "🥳 มาแล้ว! PSU Open House 2025 (งาน ม.อ. วิชาการ ประจำปี 2568) ✨ ภายใต้ Theme ม.อ. สืบต่อปณิธาน สานประโยชน์เพื่อเพื่อนมนุษย์ “มหาวิทยาลัยแห่งนวัตกรรม สังคม และการพัฒนาที่ยั่งยืน”🏫 เปิดบ้าน มหาวิทยาลัยสงขลานครินทร์พร้อมแล้ว....ให้ทุกคนได้สัมผัสประสบการณ์จริง! ในคณะที่ใช่ สาขาที่ชอบเตรียมตัวให้พร้อมแล้วมาค้นหาเส้นทางสู่ฝันไปด้วยกัน!",
    imgPath: "/images/exp5.jpg",
    logoPath: "/images/psu-logo.png",
    title: "แก้โจทย์ปัญหาโปรแกรมมิ่ง",
    date: "วันที่ 3 กันยายน 2568",
    responsibilities: [
      "ได้นำความรู้และสิ่งที่ฝึกฝนในการเขียนโปรแกรมใช้กับการแข่งขันแก้โจทย์ปัญหาโปรแกรมมิ่ง",
      "ได้รู้จักการจัดวางอัลกอริทึมว่าควรเป็นอย่างไรจึงจะข้าใจง่ายและรวดเร็ว",
      "ได้พัฒนาทักษะการทำงานกันเป็นทีมและแบ่งงานความรับผิดชอบให้กับแต่ละคนได้",
    ],
  },
    {
    review: "การแข่งขันการเขียนโปรแกรมแก้โจทย์ปัญหา โดยใช้ PYTHON, C, C++ หรือ JAVA",
    imgPath: "/images/exp6.jpg",
    logoPath: "/images/coe-logo.png",
    title: "การเขียนโปรแกรมคอมพิวเตอร์",
    date: "วันที่ 7 สิงหาคม 2568",
    responsibilities: [
      "ได้พัฒนาทักษะทางด้านโปรแกรมมิ่งและนำสิ่งที่ฝึกฝนมาต่อยอด",
      "การรู้จักแบ่งหน้าที่ความรับผิดชอบกันภายในทีมเพื่อแข่งขันกับเวลา",
    ],
  },
    {
    review: "โครงการ EGL ได้จัดกิจกรรม EGL United English Camp เพื่อให้เด็กในโครงการ EGL ได้ทำกิจกรรมพัฒนาทักษะด้านภาษาอังกฤษ ณ คณะศิลปศาสตร์ มหาวิทยาลัยสงขลานครินทร์",
    imgPath: "/images/exp7.JPG",
    logoPath: "/images/egl-logo.png",
    title: "ENG United English Camp",
    date: "วันที่ 31 สิงหาคม 2568",
    responsibilities: [
      "ได้ฝึกฝนและพัฒนาการกล้าแสดงออกและความเป็นผู้นำหัวหน้ากลุ่ม",
      "พัฒนาทักษะทางด้านภาษาอังกฤษโดยเฉพาะทางด้านการสื่อสาร",
    ],
  },
    {
    review: "New Trend for New Gen เทรนด์อาชีพสุดลํ้า กับวิศวกรรมศาสตร์และเทคโนโลยี PIM เพื่อให้ผู้เข้าร่วมโคงการได้เกิดความรู้ ความเข้าใจ พัฒนาทักษะด้านวิศวกรรมศาสตร์และเทคโนโลยีเบื้องต้น",
    imgPath: "/images/exp8.jpg",
    logoPath: "/images/pim-logo.png",
    title: "PIM Young Creative Program ครั้งที่ 378",
    date: "วันที่ 3 กุมภาพันธ์ 2567",
    responsibilities: [
      "ได้ความรู้ ความเข้าใจ พัฒนาทักษะด้านวิศวกรรมศาสตร์และเทคโนโลยีเบื้องต้น",
      "ได้ความรู้ทางด้านวิศวกรรมศาสตร์ในสาขาต่างๆที่แตกต่างกันไป",
    ],
  },
    {
    review: "โครงการ EGL ได้จัดงานทัศนศึกษาดูงานต่างประเทศ ณ ประเทศมาเลเซียและสิงคโปร์ เป็นเวลา 4 วัน 3 คืน",
    imgPath: "/images/exp9.jpg",
    logoPath: "/images/egl-logo.png",
    title: "EGL Roam Around",
    date: "วันที่ 23 - 26 กุมภาพันธ์ 2568",
    responsibilities: [
      "ได้พัฒนาทักษะการสื่อสารกับชาวต่างชาติในต่างประเทศ",
      "ได้ศึกษาดูงานในมหาวิทยาลัยต่างประเทศ",
      "ได้ใช้ทักษะที่ฝึกฝนมาให้เกิดประโยชน์ในชีวิตประจำวัน",
    ],
  },
    {
    review: "การแข่งขันบาสเกตบอล 3x3 รุ่น 18 ปีชาย ณ Sport Complex มหาวิทยาลัยสงขลานครินทร์",
    imgPath: "/images/exp10.jpg",
    logoPath: "/images/basketball-logo.png",
    title: "3X3 Basketball FLY HIGH",
    date: "วันที่ 14 - 15 ธันวาคม 2568",
    responsibilities: [
      "ได้ฝึกฝนร่างกายให้แข็งแรงอยู่ตลอดเวลา",
      "ได้พัฒนาร่างกายอยู่ตลอดเวลา ใช้เวลาให้เกิดประโยชน์สูงสุด",
    ],
  },
    {
    review: "การแข่งขันบาสเกตบอล 3x3 รุ่นประชาชนชาย ณ Sport Complex มหาวิทยาลัยสงขลานครินทร์",
    imgPath: "/images/exp11.jpg",
    logoPath: "/images/basketball-logo.png",
    title: "3X 3on3 BASKETBALL",
    date: "วันที่ 22 - 23 มีนาคม 2568",
    responsibilities: [
      "ได้มาทำกิจกรรมข้างนอกให้ร่างกายแข็งแรง",
      "พบป่ะผู้คนที่มาจากต่างอำเภอต่างจังหวัด",
      "พัฒนาร่างกายให้แข็งแรงตลอดเวลา ฝึกฝนทักษะอื่นๆเพิ่มเติม",
    ],
  },
    {
    review: "กีฬาสี ร่มเมาเกมส์ 2568 โรงเรียนมหาวชิราวุธ จังหวัดสงขลา โรงเรียนมหาวชิราวุธ จังหวัดสงขลา ได้จัดงานกีฬาสีขึ้น ภายในโรงเรียนให้กับนักเรียนชั้นมัธยมศึกษาปีที่ 1 - 6 ได้ร่วมทำกิจกรรมกันในสัปดาห์กีฬาสี โดยวัตถุประสงค์ของการจัดกิจกรรมคือ ให้นักเรียนได้รู้จักหน้าที่ความรับผิดชอบและการร่วมมือกันทำงานของนักเรียน เพื่อให้นักเรียนได้รู้ถึงประโยชน์ของความมีส่วนร่วมและความรับผิดชอบต่อหน้าที่ของตนเอง ทั้งนี้ ตัวกระผมได้ทำหน้าที่เป็นรองประธานกีฬาบาสเกตบอลของสีเขียว ได้รับหน้าที่ในการหาสมาชิกทีมและคัดสมาชิกทีมบาสเกตบอลเพื่อแข่งขัน ทั้งจัดการเอกสารเก็บข้อมูลต่างๆของสมาชิกทีม",
    imgPath: "/images/exp12.jpg",
    logoPath: "/images/mvsk-logo.png",
    title: "กีฬาสี ร่มเมาเกมส์ 2568",
    date: "วันที่ 25, 29 กรกฎาคม - 1 สิงหาคม 2568",
    responsibilities: [
      "ได้ฝึกฝนและพัฒนาทักษะการเป็นรองหัวหน้าทีม",
      "พัฒนาและวางแผนกับสมาชิกในการฝึกฝนและพูดคุยในการแข่งขันแต่ละเกม",
    ],
  },
    {
    review: "การแข่งขันบาสเกตบอล 3x3 รุ่น 18 ปีชาย ณ อำเภอสะเดา จังหวัดสงขลา",
    imgPath: "/images/exp13.jpeg",
    logoPath: "/images/basketball-logo.png",
    title: "3X3 BASKETBALL สะเดา",
    date: "วันที่ 3 - 4 พฤษภาคม 2568",
    responsibilities: [
      "ได้ให้ร่างกายขยับอยู่ตลอดเวลาเพื่อให้ร่างกายแข็งแรงง",
      "ได้รับความสนุกสนานจากการแข่งขัน",
    ],
  },
    {
    review: "ชมรมอนุรักษ์ป่าชายเลนตำบลหัวเขา ได้จัดโครงการปลูกป่าชายเลยน ตำบลหัวเขา ณ สิงหนคร",
    imgPath: "/images/exp14.jpg",
    logoPath: "/images/good-logo.png",
    title: "การปลูกป่าชายเลย ตำบลหัวเขา",
    date: "วันที่ 28 กันยายน 2568",
    responsibilities: [
      "ได้อนุรักษ์ป่าชายเลนไว้",
      "ได้รู้จักถึงการเสียสละและจิตอาสา",
      "ได้ออกมาทำกิจกรรมต่างๆในด้านจิตอาสา",
    ],
  },
];

const expLogos = [
  {
    name: "logo1",
    imgPath: "/images/logo1.png",
  },
  {
    name: "logo2",
    imgPath: "/images/logo2.png",
  },
  {
    name: "logo3",
    imgPath: "/images/logo3.png",
  },
];

const testimonials = [
  {
    name: "Esther Howard",
    mentions: "@estherhoward",
    review:
      "I can’t say enough good things about Adrian. He was able to take our complex project requirements and turn them into a seamless, functional website. His problem-solving abilities are outstanding.",
    imgPath: "/images/client1.png",
  },
  {
    name: "Wade Warren",
    mentions: "@wadewarren",
    review:
      "Working with Adrian was a fantastic experience. He transformed our outdated website into a modern, user-friendly platform. His attention to detail and commitment to quality are unmatched. Highly recommend him for any web dev projects.",
    imgPath: "/images/client3.png",
  },
  {
    name: "Guy Hawkins",
    mentions: "@guyhawkins",
    review:
      "Collaborating with Adrian was an absolute pleasure. His professionalism, promptness, and dedication to delivering exceptional results were evident throughout our project. Adrian's enthusiasm for every facet of development truly stands out. If you're seeking to elevate your website and elevate your brand, Adrian is the ideal partner.",
    imgPath: "/images/client2.png",
  },
  {
    name: "Marvin McKinney",
    mentions: "@marvinmckinney",
    review:
      "Adrian was a pleasure to work with. He turned our outdated website into a fresh, intuitive platform that’s both modern and easy to navigate. Fantastic work overall.",
    imgPath: "/images/client5.png",
  },
  {
    name: "Floyd Miles",
    mentions: "@floydmiles",
    review:
      "Adrian’s expertise in web development is truly impressive. He delivered a robust and scalable solution for our e-commerce site, and our online sales have significantly increased since the launch. He’s a true professional!",
    imgPath: "/images/client4.png",
  },
  {
    name: "Albert Flores",
    mentions: "@albertflores",
    review:
      "Adrian was a pleasure to work with. He understood our requirements perfectly and delivered a website that exceeded our expectations. His skills in both frontend and backend dev are top-notch.",
    imgPath: "/images/client6.png",
  },
];

const socialImgs = [
  {
    name: "insta",
    imgPath: "/images/insta.png",
    url: "https://www.instagram.com/d._.dorn/",
  },
  {
    name: "fb",
    imgPath: "/images/fb.png",
    url: "https://www.facebook.com/drn.rakkha/",
  },
  {
    name: "x",
    imgPath: "/images/x.png",
    url: "https://x.com/Kaimair81424764",
  },
  {
    name: "linkedin",
    imgPath: "/images/linkedin.png",
    url: "https://www.linkedin.com/in/dorn-rakkha-942b1138b/",
  },
];

export {
  words,
  abilities,
  logoIconsList,
  counterItems,
  expCards,
  expLogos,
  testimonials,
  socialImgs,
  techStackIcons,
  techStackImgs,
  navLinks,
};
